"""
元组和列表类似，可以存储多个、不同类型的元素在内
但是元组一旦定义完成，就不可以修改
需要封装数据，但是又不希望封装的数据被篡改时，就可以用元组
"""

# 元组定义使用小括号，元素间使用逗号隔开，可以是不同类型数据
my_tuple = (1, "2", [1, 2, 3, "hello"], 4, 5, False, True)
my_tuple2 = ()  # 定义一个空元组
my_tuple_3 = tuple()  # 定义一个空元组

print(type(tuple()))  # 打印元组类型

# 如果元组只有一个元素，就必须要要加个逗号
my_tuple4 = (12,)

# 下标索引规则和列表一样

# index查找下标
tu = (1, 2, 3, 4)
index = tu.index(3)
print(index)  # 2

# count统计方法
tu2 = (1, 1, 1, 1, 1, 2, 3, 4, 5, 6)
num = tu2.count(1)  # 统计1的个数
print(num)  # 5

# len，获取元素数量
print(len(tu2))  # 10

# 遍历
for i in tu2:
    print(i, " ", end="")
print()
# # 修改元组元素，会报错
# tu2[1] = 10

# 但是如果元组内有一个列表，那么可以修改列表里面的元素
tu4 = ([1, 2, 3, 4, 5], 6, 7, 8, 9)
print(tu4[0][0])
tu4[0][0] = 100000
print(tu4[0][0])
